#==============================================================================
#    ☆VX RGSS2 「装備能力限界突破」☆
#　　　　　　EnDlEss DREamER
#     URL:http://mitsu-evo.6.ql.bz/
#     製作者 mitsu-evo
#     Last:2009/11/19
#　　 武器防具の能力上限「500」を超えて設定する。
#     ▼ 「▼ 素材」に近い位置に挿入。
#==============================================================================
=begin
☆☆☆☆☆☆　挿入位置　☆☆☆☆☆☆

　　素材の最上部に挿入してください。
　　個別武器コマンドや装備拡張：武器拡張追加などのスクリプトよりも上。
　　
　　
☆☆☆☆☆☆　機能説明　☆☆☆☆☆☆
　
　　武器・防具のメモ欄に 
　　<攻撃力 9999> <防御力 9999> <精神力 9999> <敏捷性 9999>
    等の記述を入れると設定した数値の攻撃力となります。
    
    ただしKGC様「限界突破」などのスクリプトを導入しない限り
    999を超えて設定しても上限が999なのでそれ以上は反映されません。
    
    データベース設定での500上限が物足りないという人用の素材です。
    
=end
$ed_rgss2 = {} if $ed_rgss2 == nil
$ed_rgss2["ed_equip_over_param"] = true
  # メモ欄取得用定数
  
  EQUIP_ATK_PARAM = /<(?:ATK|攻撃力)\s*(\d+)>/i
  EQUIP_DEF_PARAM = /<(?:DEF|防御力)\s*(\d+)>/i
  EQUIP_SPI_PARAM = /<(?:SPI|精神力)\s*(\d+)>/i
  EQUIP_AGI_PARAM = /<(?:AGI|敏捷性)\s*(\d+)>/i

module RPG
  class Weapon < BaseItem
    #--------------------------------------------------------------------------
    # ● 攻撃力の取得
    #--------------------------------------------------------------------------
    def atk
      self.note.each_line { |line|
        if line =~ EQUIP_ATK_PARAM
          @atk = $1.to_i
          next if @atk == nil
        end
      }
      return @atk
    end
    #--------------------------------------------------------------------------
    # ● 防御力の取得
    #--------------------------------------------------------------------------
    def def
      self.note.each_line { |line|
        if line =~ EQUIP_DEF_PARAM
          @def = $1.to_i
          next if @def == nil
        end
      }
      return @def
    end
    #--------------------------------------------------------------------------
    # ● 精神力の取得
    #--------------------------------------------------------------------------
    def spi
      self.note.each_line { |line|
        if line =~ EQUIP_SPI_PARAM
          @spi = $1.to_i
          next if @spi == nil
        end
      }
      return @spi
    end
    #--------------------------------------------------------------------------
    # ● 敏捷性の取得
    #--------------------------------------------------------------------------
    def agi
      self.note.each_line { |line|
        if line =~ EQUIP_AGI_PARAM
          @agi = $1.to_i
          next if @agi == nil
        end
      }
      return @agi
    end
  end
end

module RPG
  class Armor < BaseItem
    #--------------------------------------------------------------------------
    # ● 攻撃力の取得
    #--------------------------------------------------------------------------
    def atk
      self.note.each_line { |line|
        if line =~ EQUIP_ATK_PARAM
          @atk = $1.to_i
          next if @atk == nil
        end
      }
      return @atk
    end
    #--------------------------------------------------------------------------
    # ● 防御力の取得
    #--------------------------------------------------------------------------
    def def
      self.note.each_line { |line|
        if line =~ EQUIP_DEF_PARAM
          @def = $1.to_i
          next if @def == nil
        end
      }
      return @def
    end
    #--------------------------------------------------------------------------
    # ● 精神力の取得
    #--------------------------------------------------------------------------
    def spi
      self.note.each_line { |line|
        if line =~ EQUIP_SPI_PARAM
          @spi = $1.to_i
          next if @spi == nil
        end
      }
      return @spi
    end
    #--------------------------------------------------------------------------
    # ● 敏捷性の取得
    #--------------------------------------------------------------------------
    def agi
      self.note.each_line { |line|
        if line =~ EQUIP_AGI_PARAM
          @agi = $1.to_i
          next if @agi == nil
        end
      }
      return @agi
    end
  end
end
